# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

n = int(input("Введите трёхзначное число: "))
d1 = n // 100
d2 = ((n % 100) // 10)
d3 = n % 10 
sum_d = d1 + d2 + d3
print (sum_d)
